
{
    "description1": "Olen intohimoinen ohjelmistoinsinööri, joka on erikoistunut full-stack-kehitykseen ja DevOpsiin. Kokemukseni kattaa sekä front-endin että back-endin, mikä antaa minulle mahdollisuuden toimittaa integroidut ja korkean suorituskyvyn sovellukset. Vahvalla pohjalla moderneissa kehys- ja ohjelmointikielissä erottelen itseni intuitiivisten ja mukautuvien käyttöliittymien luomisessa, jotka toimivat täydellisesti kaikilla laitteilla, yhdessä robuustien ja skaalautuvien back-end-ratkaisujen kanssa, jotka tukevat niitä.",
    "description2": "DevOpsin alueella minulla on kokemusta käyttöönoton automatisoinnista, infrastruktuurin hallinnasta ja järjestelmien luotettavuuden ja turvallisuuden varmistamisesta. Taito CI/CD:ssä, sovellusten konttien hallinnassa ja pilvipalveluissa nopeuttavat kehitystä ja luovat johdonmukaisia ja tehokkaita työskentelyprosesseja. Tavoitteeni on aina optimoida kehityksen elinkaaren hallinta, varmistaen nopean ja luotettavan toimituksen sekä ensiluokkaisen käyttäjäkokemuksen.",
    "description3": "Tekniset taitoni sisältävät:",
    "skill1": "Full-Stack-kehitys (MERN ja PERN Stack)",
    "skill2": "Frontend-frameworkit: React, Redux, Next.js",
    "skill3": "Backend-kehitys: Node.js, Express, REST-rajapinnat, GraphQL",
    "skill4": "Tietokannan hallinta: MongoDB, PostgreSQL, MySQL",
    "skill5": "Pilvipalvelut ja infrastruktuuri: AWS (EC2, S3, RDS, Lambda)",
    "skill6": "CI/CD-infrastruktuuri ja DevOps: Docker, Kubernetes, Jenkins",
    "skill7": "Serverittoman arkkitehtuurin ja mikropalveluiden käyttö",
    "skill8": "Tietoturva ja todennus (OAuth, JWT)",
    "skill9": "Sertifikaatit: AWS Certified Solutions Architect, AWS Certified Developer",
    "description4": "Jokaisessa projektissa minut motivoi ongelmanratkaisu, yhteistyö ja jatkuva oppiminen pysyäkseni ajan tasalla uusimmista teknologioista. Olen innoissani siitä, että voin tuoda sekä luonteenpiirteitä että tarkkuutta tekemääni työhön, auttaen yrityksiä muuntamaan ideansa todellisuudeksi.",
    "projects-title": "Nykyiset projektit",
    "fitapp-title": "Fitapp",
    "fitapp-description": "Fitapp on alustojen välinen kunnonseurantasovellus, joka on rakennettu React Nativella ja TypeScriptillä Androidille ja iOS:lle. Sovellus sisältää GPS-pohjaisen aktiivisuuden seurannan (km/päivä), päivittäisen/viikoittaisen/kuukausittaisen edistymisen visualisoinnin, monikielisen tuen (englanti ja espanja), vaalean/tumman teeman vaihdon sekä henkilökohtaiset tavoitteet käyttäjäprofiilin perusteella. Fitapp tarjoaa interaktiivisia pylväsdiagrammeja, reaaliaikaisia tilastoja ja turvallisen kirjautumisen.",
    "vibing-title": "Vibing",
    "vibing-description": "Vibing on moderni treffialusta, joka on suunniteltu todellisiin yhteyksiin. Se sisältää käyttäjäprofiilit, pyyhkäisypohjaisen yhdistämisen ja turvallisen todennuksen luotettavan treffikokemuksen takaamiseksi. Vibing mahdollistaa reaaliaikaisen viestinnän WebSocket-pohjaisen chatin kautta, jonka avulla käyttäjät voivat osallistua saumattomiin ja välittömiin keskusteluihin. Tyylikkään, käyttäjäystävällisen käyttöliittymän ja vankkojen yksityisyysominaisuuksien avulla.",
    "streamtube-title": "StreamTube",
    "streamtube-description": "StreamTube on suoratoistosovelluksen projekti, joka on saanut inspiraationsa alustoilta kuten Netflix. Se sallii käyttäjien selata, suoratoistaa ja katsella laajaa elokuvavalikoimaa torrent-linkkien kautta, tarjoten saumattoman videon toiston suoraan sovelluksessa. Rakennettu full-stack-kehityksen lähestymistavalla, StreamTube sisältää käyttäjäautentikoinnin, profiilinhallinnan, hakutoiminnon ja monikielisen tuen. Projekti yhdistää front-end- ja back-end-taidot, vaativat kolmannen osapuolen API:iden integrointia, turvallisia käyttäjäsessioita ja responsiivista suunnittelua tarjotakseen intuitiivisen ja monipuolisen suoratoistokokemuksen.",
    "technologies": "Teknologiat:",
    "contact-title": "Yhteystiedot",
    "name-label": "Nimi",
    "email-label": "Sähköposti",
    "message-label": "Viesti",
    "send-message": "Lähetä viesti",
    "contact-get-in-touch": "Ota yhteyttä",
    "contact-info": "Olen aina avoin uusille yhteydenotoille sekä keskusteluille projekteista, innovatiivisista ideoista ja mahdollisista yhteistyömahdollisuuksista. Jos etsit jotakuta, joka voi auttaa toteuttamaan visiosi luovuudella ja teknisellä asiantuntemuksella, tutustun mielelläni siihen, kuinka voisimme työskennellä yhdessä.",
    "about": "Tietoa",
    "projects": "Projektit",
    "contact": "Yhteystiedot",
    "language": "Kieli"
}
