{
    "description1": "I am a passionate Software Engineer specialized in Full-stack development and DevOps. My experience spans both front-end and back-end, enabling me to deliver integrated, high-performance applications. With a strong foundation in modern frameworks and languages, I excel at creating intuitive and adaptive user interfaces that work seamlessly across all devices, along with robust, scalable back-end solutions that support them.",
    "description2": "In the field of DevOps, I have experience in automating deployments, managing infrastructure, and ensuring systems are reliable and secure. With knowledge in CI/CD, containerizing apps, and utilizing cloud services to streamline development and create consistent, efficient workflows. My goal is always to optimize the development lifecycle, ensuring fast, reliable delivery and a top-quality user experience.",
    "description3": "My technical skills include:",
    "skill1": "Full-Stack Development (MERN and PERN Stack)",
    "skill2": "Frontend Frameworks: React, Redux, Next.js",
    "skill3": "Backend Development: Node.js, Express, REST APIs, GraphQL",
    "skill4": "Database Management: MongoDB, PostgreSQL, MySQL",
    "skill5": "Cloud Services and Infrastructure: AWS (EC2, S3, RDS, Lambda)",
    "skill6": "CI/CD Infrastructure and DevOps: Docker, Kubernetes, Jenkins",
    "skill7": "Serverless Architecture and Microservices",
    "skill8": "Data Security and Authentication (OAuth, JWT)",
    "skill9": "Certifications: AWS Certified Solutions Architect - Associate, AWS Certified Developer - Associate",
    "description4": "In every project, I am motivated by problem-solving, collaboration, and continuous learning to stay up-to-date with the latest technologies. I am excited to bring both creativity and precision to the work I do, helping companies transform their ideas into reality.",
    "projects-title": "Current Projects",
    "vibing-title": "Vibing",
    "vibing-description": "Vibing is a modern dating platform designed for real connections. It features user profiles, swipe-based matching, and secure authentication for a reliable dating experience. Vibing enables real-time communication via WebSocket-powered chats, allowing users to engage in instant, fluid conversations. With a sleek, user-friendly interface and robust privacy features.",
    "streamtube-title": "StreamTube",
    "streamtube-description": "StreamTube is a streaming application project inspired by platforms like Netflix. It allows users to browse, stream, and watch a wide range of movies via torrent links, providing smooth video playback directly within the app. Built with a full-stack development approach, StreamTube includes user authentication, profile management, search functionality, and multilingual support. The project combines front-end and back-end skills, requiring third-party API integration, secure user sessions, and responsive design to deliver an intuitive and feature-rich streaming experience.",
    "technologies": "Technologies:",
    "contact-title": "Contact",
    "name-label": "Name",
    "email-label": "Email",
    "message-label": "Message",
    "send-message": "Send message",
    "contact-get-in-touch": "Get in touch",
    "contact-info": "I am always open to connecting and discussing new projects, innovative ideas, and potential collaborations. If you are looking for a dedicated partner to help bring your vision to life with creativity and technical expertise, I would love to explore how we can work together.",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "language": "Language"
}
